; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob7654) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear crate0)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate5)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate3)
	(at truck0 depot1)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 distributor2)
	(on crate3 crate2)
	(at crate4 depot2)
	(on crate4 pallet2)
	(at crate5 distributor0)
	(on crate5 pallet3)
)

(:goal (and
		(on crate0 crate4)
		(on crate2 pallet3)
		(on crate3 pallet0)
		(on crate4 pallet5)
	)
)
(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 0 of 4
2. (load hoist2 crate4 truck1 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   goals met: 0 of 4
3. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 0 of 4
4. (lift hoist5 crate3 crate2 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 crate2)
   added: (lifting hoist5 crate3) (clear crate2)
   goals met: 0 of 4
5. (load hoist5 crate3 truck1 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck1) (available hoist5)
   goals met: 0 of 4
6. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 0 of 4
7. (load hoist5 crate2 truck1 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck1) (available hoist5)
   goals met: 0 of 4
8. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 0 of 4
9. (drop hoist5 crate4 pallet5 distributor2)
   deleted: (lifting hoist5 crate4) (clear pallet5)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 pallet5)
   goals met: 1 of 4
10. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 4
11. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 1 of 4
12. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 1 of 4
13. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 1 of 4
14. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 2 of 4
15. (lift hoist3 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet3)
   added: (lifting hoist3 crate5) (clear pallet3)
   goals met: 2 of 4
16. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 4
17. (load hoist3 crate5 truck1 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck1) (available hoist3)
   goals met: 2 of 4
18. (unload hoist3 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 2 of 4
19. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet3)
   goals met: 3 of 4
20. (lift hoist1 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 3 of 4
21. (load hoist1 crate0 truck0 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 3 of 4
22. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 3 of 4
23. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 3 of 4
24. (drop hoist5 crate0 crate4 distributor2)
   deleted: (lifting hoist5 crate0) (clear crate4)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 crate4)
   goals met: 4 of 4
